Repository: Cet500/FlaskTestingSystem
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Submit
es: Aceptar
ru: Принять

source: Username
es: Acceso
ru: Логин

source: Password
es: Contraseña
ru: Пароль

source: Remember me
es: Recuérdame
ru: Запомнить меня

source: Sign in
es: Registrarse
ru: Войти в систему

source: Name
es: Nombre
ru: Имя

source: Lastname
es: Apellido
ru: Фамилия

source: Email
ru: Эл. почта

source: Group
es: Grupo
ru: Группа

source: Role
es: Papel
ru: Роль

source: Student
es: Estudiante
ru: Студент

source: Teacher
es: Profesor
ru: Учитель

source: Repeat password
es: repite la contraseña
ru: Повторите пароль

source: Register
es: registrarse
ru: Регистрация

source: Please use a different login
es: Utilice una contraseña diferente
ru: Пожалуйста, используйте другой пароль

source: Use only A-Z, a-z, 0-9 and _
es: Use solo letras y números
ru: Используйте только буквы и цифры

source: Please use a different email
ru: Пожалуйста, используйте другой адрес эл. почты

source: Use letter in password
es: Usa letras mayúsculas
ru: Используйте прописные буквы

source: Use capital in password
es: Usa letras mayúsculas
ru: Используйте заглавные буквы

source: Use number in password
es: Usar números
ru: Используйте числа

source: Title
es: Bóveda
ru: Заголовок

source: Description
es: Descripción
ru: Описание

source: Add group
es: Añadir grupo
ru: Добавить группу

source: Update group
es: Actualizar grupo
ru: Обновить группу

source: Name of test
es: Nombre de la prueba
ru: Имя теста

source: Annotation of test
es: Resumen de prueba
ru: Аннотация теста

source: Description of test
es: Descripción de la prueba
ru: Описание теста

source: Add test
es: Agregar prueba
ru: Добавить тест

source: Difficult of test
es: Prueba de dificultad
ru: Сложность теста

source: Update test
es: Prueba de actualización
ru: Обновить тест

source: All tests
es: Todas las pruebas
ru: Все тесты

source: Test by groups
es: Pruebas grupales
ru: Тесты по группам

source: Info
es: Información
ru: Информация

source: Testing
es: Pruebas
ru: Тестирование

source: Result
es: Resultado
ru: Результат

source: Profile
ru: Профиль

source: Change of group
es: Cambiar de grupo
ru: Изменить группу

source: Test resume for mark
es: Conclusión de la prueba al evaluar
ru: Заключение теста при оценке

source: Test resume for key
es: Conclusión de la prueba de la llave
ru: Заключение теста для ключа

source: Change of test
es: Prueba de cambio
ru: Изменить тест

source: Admin-panel
ru: Админ-панель

source: Tables
ru: Таблицы

source: Tests
ru: Тесты

source: Results
ru: Результаты

source: Statistic
ru: Статистика

source: API methods list
ru: Список методов API

source: About TeSi
es: Sobre TeSi
ru: О ТеСи

source: About us
es: Sobre nosotros
ru: О нас

source: Errors
es: Errores
ru: Ошибки

source: Error 404
ru: Ошибка 404

source: Error 405
ru: Ошибка 405

source: Error 500
ru: Ошибка 500

source: Briefly about the system
es: Brevemente sobre el sistema
ru: Кратко о системе

source: TeSi is a Test System created by order of an educational institution and designed to create and pass various tests.
es: TeSi es un sistema de pruebas creado por orden de una institución educativa ydiseñado para crear y aprobar varias pruebas"
ru: ТеСи - это Тестовая Система, созданная по заказу учебного заведения и предназначенная для создания и прохождения различных тестов.

source: History of creation
es: Historia de la creacion
ru: История создания

source: Initially, this system appeared as a test shell for coursework and was written in C#, using WinForms. It was a fairly simple program, but it was already possible to create and pass tests in it. There was even a "board of honor" where you could see who was the best at solving tests. All the data was stored in a single MySQL database, so you could even do this - deploy one database, and connect many clients to it, thereby obtaining "centralization". One immediately after the end of the course, this project was abandoned as unnecessary.
es: Originalmente, este sistema apareció como un caparazón de prueba para el trabajo del curso"funciona y fue escrito en C # usando WinForms. Fueun programa bastante simple, pero ya era posible crear ypara tomar exámenes. Incluso había un " tablero de honor \ "en el que era posiblepara ver quién es el mejor resolviendo pruebas. Todos los datos se almacenaron en una única base de datosDatos MySQL, por lo que incluso podría hacer esto: implementar una base de datosy conectar a muchos clientes con él, obteniendo" centralización. \ "Uno inmediatamente después del final del trabajo del curso, este proyecto fueabandonado por innecesario"
ru: Первоначально, эта система появилась как тестовая оболочка для курсовой работы и была написана на C#, с использованием WinForms. Это была достаточно простая программа, однако в ней уже можно было создавать и проходить тесты. Даже была "доска почёта", на которой можно было увидеть, кто лучше всех решает тесты. Все данные хранились в единой базе данных MySQL, так что можно было даже сделать так - развернуть одну базу, а к ней подключить к ней множество клиентов, получив тем самым "централизацию". Одна сразу же за окончанием курсовой, этот проект был заброшен за ненадобностью.

source: The current version is a different system, even if it is built on the same principles as before. This is a Web application based on Flask. The capabilities are the same - creating and passing tests, but the internal architecture is built quite differently. If everything was previously unloaded, then on the contrary, decomposition is used - that is, splitting into small parts. But the database and its general structure is the same - it is MySQL. This DBMS has long been reliably showing itself and it makes no sense to replace it.
es: La versión actual es un sistema diferente, aunque construido sobre el mismoLos mismos principios que antes. Esta es una aplicación web basada en Flask"Las posibilidades son las mismas, sin embargo, crear y aprobar pruebasla arquitectura interna está construida de una manera completamente diferente. Si todo fuera antescargado, por el contrario, se utiliza la descomposición, es decir, dividir enpartes pequeñas. Pero la base de datos y su estructura general son las mismas, esto esMySQL. Este DBMS se ha mostrado confiable durante mucho tiempo y no hay sustituto para él"significado.
ru: Нынешняя же версия - это уже иная система, пусть и построенная на тех же самых принципах, как и ранее. Это Web-приложение, основанное на Flask. Возможности те же самые - создание и прохождение тестов, однако внутренняя архитектура построена совсем иначе. Если ранее всё было сгружено, то тут напротив, используется декомпозиция - т.е. разбиение на небольшие части. А вот база данных и её общая структура та же самая - это MySQL. Данная СУБД уже давно надёжно себя показывает и заменять её нет смысла.

source: Future plans
es: Planes futuros
ru: Планы на будущее

source: In general, the system is mostly ready - but there is always something to improve. Probably, this site will just be constantly expanding and developing. There are simply no concrete global plans.
es: En general, el sistema está casi listo, pero siempre hay algo"finalizar. Es probable que este sitio siga expandiéndose ypara desarrollar. Simplemente no hay planes globales específicos"
ru: В целом, система в большей степени уже готова - однако всегда есть что доработать. Вероятно, этот сайт будет просто постоянно расширяться и развиваться. Конкретных же глобальных планов просто нет.

source: Open source code
es: Fuente abierta
ru: Открытый исходный код

source: This system is not something special, so it was decided to open the source code to everyone-the actual link to the repository is always at the bottom of the page. I really like the open source movement, so this decision is another small support for the desire for freedom. Everyone can contribute to the common cause, and this is the reason why I will not stay away.
es: Este sistema no es algo especial, por eso se decidió abrircódigo fuente para todos: un vínculo real al repositorio siempreestá en la parte inferior de la página. Me gusta mucho el movimiento de código abierto"Por tanto, esta decisión es otro pequeño apoyo a la consecución deLibertad. Todos pueden contribuir a la causa común, y esta es la razón por la queque no me apartaré"
ru: Данная система не является чем-то особым, поэтому было решено открыть исходный код для всех желающих - актуальная ссылка на репозиторий всегда находится внизу страницы. Мне очень нравится движение открытого ПО, поэтому данное решение - это ещё одна небольшая поддержка стремления к свободе. Каждый в может внести свой вклад в общее дело, и это причина, по которой я не останусь в стороне.

source: Thanks to the development team
es: Gracias al equipo de desarrollo
ru: Благодарность команде разработки

source: As much as I would like to write a la "We are a team of ambitious developers...", I can not do this, because I create all this only by myself. However, I would like to express my gratitude to all those who help me from the shadows. Guys, thank you, this would not have happened without you.
es: Por mucho que no me gustaría escribir a la " Somos un equipo de ambiciosos desarrolladores ... ", no puedo hacer esto porque Soy el único que crea todo esto Solo. Sin embargo, me gustaría expresar mi gratitud a todos los que ayudan"Estoy fuera de las sombras. Chicos, gracias, sin ustedes esto no habría sucedido"
ru: Как бы мне не хотелось написать а-ля "Мы - команда амбициозных разработчиков...", я не могу этого сделать, т.к. создаю всё это лишь я один. Однако, мне хочется выразить благодарность всем тем, кто помогает мне из тени. Ребят, спасибо, без вас этого не было бы.

source: And of course, thanks to the customer, without whom this system would not exist at all. For this system has some meaning for me. Like things on a shelf, just by looking at them, you remember the past.
es: existía. Porque este sistema tiene un cierto significado para mí. Como cosas enLa estantería, con sólo mirarla, te acuerdas del pasado"
ru: Ну и конечно спасибо заказчику, без которого этой системы вообще бы не существовало. Ибо эта система для меня имеет некое значение. Как вещи на полке, лишь посмотрев на которые, ты вспоминаешь прошлое.

source: Methods of users
ru: Методы пользователей

source: Get users count
ru: Получить количество пользователей

source: Returns the number of registered users in the system
ru: Возвращает количество пользователей, зарегистрированных в системе

source: Methods of groups
ru: Методы групп

source: Get groups count
ru: Получить количество групп

source: Returns the number of groups that combine tests in the system
ru: Возвращает количество групп, что объединяют тесты в системе

source: Get groups list
ru: Получить список групп

source: Returns the list of all groups of the system in JSON format
ru: Возвращает список всех групп тестов системы в формате JSON

source: Methods of tests
ru: Методы тестов

source: Get tests count
ru: Получить количество тестов

source: Returns the number of open tests in the system
ru: Возвращает количество открытых тестов в системе

source: Get tests list
ru: Получить список тестов

source: Returns the list of all open tests in JSON format
ru: Возвращает список всех открытых тестов формате JSON

source: Get tests count by group
ru: Получить количество тестов в группе

source: Returns the number of open tests in a single group system
ru: Возвращает количество открытых тестов в одной группе

source: Get tests list by group
ru: Получить список тестов в группе

source: Returns the list of open tests in a single group in JSON format
ru: Возвращает список открытых тестов в одной группе в формате JSON

source: Methods of results
ru: Методы прохождений

source: Get results count
ru: Получить количество прохождений

source: Returns the number of passes of all tests in the system
ru: Возвращает количество прохождений всех тестов в системе

source: Get results list
ru: Получить список прохождений

source: Returns the list of passes of all tests in the system in JSON format
ru: Возвращает список прохождений всех тестов в системе в формате JSON

source: Get results count by test
ru: Получить количество прохождений одного теста

source: Returns the number of passes of one specific test in the system.
ru: Возвращает количество прохождений одного определённого теста в системе

source: profile
ru: профиль

source: watch statistic
ru: статистика

source: watch tables
ru: таблицы

source: add group
es: añadir grupo
ru: добавить группу

source: add test
es: agregar prueba
ru: добавить тест

source: methods of API
ru: методы API

source: logout
es: producción
ru: выход

source: login
es: acceso
ru: вход в систему

source: register
es: registrarse
ru: регистрация

source: We are for open software
es: Estamos a favor del software de código abierto
ru: Мы за открытое ПО

source: Open API
ru: Открытое API

source: Show all tests
es: Mostrar todas las pruebas
ru: Показать все тесты

source: Count questions:
es: Numero de preguntas:
ru: Количество вопросов:

source: Number of playthroughs:
es: Número de pases:
ru: Число прохождений:

source: Average mark:
es: Puntuación media:
ru: Средняя оценка:

source: Difficult:
es: Complejidad:
ru: Сложность:

source: Raiting:
es: Clasificación:
ru: Рейтинг:

source: Start test
es: Iniciar prueba
ru: Начать тест

source: Result by
es: Resultado por
ru: Результат по

source: Name of the test subject:
es: Nombre del examinado:
ru: Имя тестируемого:

source: Anonimus
es: Anónimamente
ru: Анонимно

source: Datetime of test:
es: Tiempo de prueba:
ru: Время теста:

source: Total questions / correct answers:
es: Total de preguntas / correctas:
ru: Всего вопросов / правильных:

source: Percent correct answers:
es: Porcentaje de respuestas correctas:
ru: Процент верных ответов:

source: Your future аctivity -
es: Tu actividad futura -
ru: Ваша будущая деятельность -

source: too many
es: demasiado
ru: слишком много

source: no data
es: no hay datos
ru: нет данных

source: crop production
es: cultivo de plantas
ru: растениеводство

source: public catering
es: abastecimiento
ru: общественное питание

source: clothing manufacturing
es: industria textil
ru: швейное производство

source: Woodworking
es: carpintero
ru: деревообработка

source: locksmith work
es: trabajo de cerrajero
ru: слесарные работы

source: decorative works
es: trabajo decorativo
ru: декоративные работы

source: construction
es: edificio
ru: строительство

source: working professions
es: ocupaciones de cuello azul
ru: рабочие профессии

source: housing and communal services
es: Vivienda y servicios públicos
ru: жилищно-коммунальное хозяйство

source: more variants
es: Varias variantes
ru: несколько вариантов

source: null
es: vacío
ru: пустота

source: Final mark:
es: Nota final:
ru: Итоговая оценка:

source: 5 (excellent)
es: 5 (excelente)
ru: 5 (отлично)

source: 4 (good)
es: 4 (bueno)
ru: 4 (хорошо)

source: 3 (satisfactory)
es: 3 (satisfactorio)
ru: 3 (удовлетворительно)

source: 2 (bad)
es: 2 (malo)
ru: 2 (плохо)

source: Back to main
es: Vuelve a la página inicial
ru: Вернуться на главную страницу

source: Solve test again
es: Resuelve la prueba de nuevo
ru: Решить тест опять

source: Table of groups
ru: Таблица групп

source: title
ru: имя

source: tests
ru: тестов

source: datetime_add
ru: дата/время созд.

source: datetime_upd
ru: дата/время обн.

source: Table of results
ru: Таблица результатов

source: user
ru: пользователь

source: test
ru: тест

source: mark
ru: оценка

source: score
ru: счёт

source: percent
ru: процент

source: Table of tests
ru: Таблица тестов

source: group
ru: группа

source: name
ru: имя

source: difficult
ru: сложность

source: quests
ru: вопросов

source: results
ru: пройдено

source: Table of users
ru: Таблица пользователей

source: lastname
ru: фамилия

source: role
ru: роль

source: registated
ru: регистрация

source: updated
ru: обновлено

source: student
ru: студент

source: admin
ru: админ

source: Error 404: Not Found
es: Error 404 no encontrado
ru: Ошибка 404: Не найдено

source: Your url:
es: Su dirección:
ru: Ваш адрес:

source: You may have made a mistake somewhere. Try again or
es: Puede que te hayas equivocado. Inténtalo de nuevo o
ru: Возможно, вы ошиблись. Попробуйте ещё раз или

source: back to main page
es: Regresa a la página principal
ru: вернитесь на главную страницу

source: Error 405: Method Not Allowed
es: Error 405: método no permitido
ru: Ошибка 405: Метод не разрешён

source: You are accessing the server using the wrong method. But we'll fix it. Try again or
es: Está accediendo al servidor con el método incorrecto. Pero lo arreglaremos. Pruébelootra vez o
ru: Вы обращаетесь к серверу неверным методом. Но мы это починим. Попробуйте ещё раз или

source: Error 500: Internal Server Error
es: Error 500 - Error Interno del Servidor
ru: Ошибка 500: Внутренняя ошибка сервера

source: This is a server-side error. We're already aware of the problem, so things should get better soon. Try again or
es: Este es un error del lado del servidor. Ya conocemos el problema, muy pronto"todo debería estar bien. Vuelve a intentarlo o
ru: Это ошибка на серверной стороне. Мы уже знаем о проблеме, так что скоро всё должно наладиться. Попробуйте ещё раз или

source: Update profile
ru: Обновить профиль

source: Update
es: Actualizar
ru: Обновить

source: Read more
es: Más detalles
ru: Подробнее

source: Be tested
es: Decidir
ru: Решить
